kb1c/src/Catalogs/НовостиБазыЗнаний/НовостиБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НовостиБазыЗнаний</name>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектБазыЗнаний</name>
    <type>
      <types>CatalogRef.КатегорииБазыЗнаний</types>
      <types>CatalogRef.СтатьиБазыЗнаний</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидыНовостейБазыЗнаний</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьАвтор</name>
    <type>
      <types>CatalogRef.ПользователиБазыЗнаний</types>
    </type>
  </attributes>
</mdclass:Catalog>

kb1c/src/InformationRegisters/ИзбранноеБазыЗнаний/ИзбранноеБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзбранноеБазыЗнаний</name>
  <resources>
    <name>Создание</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Изменение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Удаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Оповещение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Прочее</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияБазыЗнаний</name>
    <type>
      <types>CatalogRef.КатегорииБазыЗнаний</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПользователь</name>
    <type>
      <types>CatalogRef.ПользователиБазыЗнаний</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

kb1c/src/InformationRegisters/ПолучателиНовостейБазыЗнаний/ПолучателиНовостейБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПолучателиНовостейБазыЗнаний</name>
  <resources>
    <name>Просмотрено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Новость</name>
    <type>
      <types>CatalogRef.НовостиБазыЗнаний</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПользователь</name>
    <type>
      <types>CatalogRef.ПользователиБазыЗнаний</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

kb1c/src/Enums/ВидыНовостейБазыЗнаний/ВидыНовостейБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНовостейБазыЗнаний</name>
  <enumValues>
    <name>Создание</name>
  </enumValues>
  <enumValues>
    <name>Изменение</name>
  </enumValues>
  <enumValues>
    <name>Удаление</name>
  </enumValues>
  <enumValues>
    <name>Оповещение</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

kb1c/src/Catalogs/СтатьиБазыЗнаний/СтатьиБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиБазыЗнаний</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретПубликации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеИзменений</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолныйТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоложениеСодержания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Черновик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтветственный</name>
    <type>
      <types>CatalogRef.ПользователиБазыЗнаний</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Содержание</name>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Родитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстHTML</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСоздания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Уровень</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИзменений</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РазрешитьСворачивание</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Картинки</name>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выравнивание</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Граница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подсказка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Таблицы</name>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выравнивание</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбтеканиеТекста</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТаблицаСтилейHTML</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстТаблицыHTML</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Категории</name>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.КатегорииБазыЗнаний</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сноски</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГиперссылкаТип</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГиперссылкаАдрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ГиперссылкаОткрывать</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГиперссылкаПодсказка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГиперссылки</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Открывать</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подсказка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

kb1c/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

kb1c/src/Catalogs/НовостиБазыЗнаний/ManagerModule.bsl
Процедура ДополнитьВышестоящимиКатегориями(МассивКатегорий, КатегорияСсылка)
	РодительСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КатегорияСсылка, "Родитель");
	Если ЗначениеЗаполнено(РодительСсылка) Тогда
		Если МассивКатегорий.Найти(РодительСсылка) = Неопределено Тогда
			МассивКатегорий.Добавить(РодительСсылка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьМассивКатегорийПоСтатье(СтатьяСсылка)
	
	МассивКатегорий = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", СтатьяСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатьиБазыЗнанийКатегории.Категория,
	|	СтатьиБазыЗнанийКатегории.Категория.Родитель КАК Родитель
	|ИЗ
	|	Справочник.СтатьиБазыЗнаний.Категории КАК СтатьиБазыЗнанийКатегории
	|ГДЕ
	|	СтатьиБазыЗнанийКатегории.Ссылка = &Ссылка";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат МассивКатегорий;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если МассивКатегорий.Найти(Выборка.Категория) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МассивКатегорий.Добавить(Выборка.Категория);
		
		Если ЗначениеЗаполнено(Выборка.Родитель) И МассивКатегорий.Найти(Выборка.Родитель) = Неопределено Тогда
			МассивКатегорий.Добавить(Выборка.Родитель);
			ДополнитьВышестоящимиКатегориями(МассивКатегорий, Выборка.Родитель);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивКатегорий;
	
КонецФункции

Процедура ДополнитьПолучателейНовостиПоВидуИОбъекту(Получатели, ВидНовости, ОбъектБазыЗнаний)
	
	Если ТипЗнч(ОбъектБазыЗнаний) = Тип("СправочникСсылка.СтатьиБазыЗнаний") Тогда
		МассивКатегорий = ПолучитьМассивКатегорийПоСтатье(ОбъектБазыЗнаний);
	ИначеЕсли ТипЗнч(ОбъектБазыЗнаний) = Тип("СправочникСсылка.КомментарииБазыЗнаний") Тогда
		СтатьяВладелец	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектБазыЗнаний, "Владелец");
		МассивКатегорий	= ПолучитьМассивКатегорийПоСтатье(СтатьяВладелец);
	ИначеЕсли ТипЗнч(ОбъектБазыЗнаний) = Тип("СправочникСсылка.КатегорииБазыЗнаний") Тогда
		МассивКатегорий = Новый Массив;
		МассивКатегорий.Добавить(ОбъектБазыЗнаний);
		ДополнитьВышестоящимиКатегориями(МассивКатегорий, ОбъектБазыЗнаний);
		
		// Если добавили категорию на самый первый уровень тогда оповестим всех
		Если МассивКатегорий.Количество() = 1 И ВидНовости = Перечисления.ВидыНовостейБазыЗнаний.Создание Тогда
			Получатели.Добавить(Справочники.Пользователи.ПустаяСсылка());
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПеречислениеМенеджер = Перечисления.ВидыНовостейБазыЗнаний;
	
	СоответствиеТипов = Новый Соответствие;
	СоответствиеТипов.Вставить(ПеречислениеМенеджер.Создание	, "Создание");
	СоответствиеТипов.Вставить(ПеречислениеМенеджер.Изменение	, "Изменение");
	СоответствиеТипов.Вставить(ПеречислениеМенеджер.Удаление	, "Удаление");
	СоответствиеТипов.Вставить(ПеречислениеМенеджер.Оповещение	, "Оповещение");
	СоответствиеТипов.Вставить(ПеречислениеМенеджер.Прочее		, "Прочее");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("Категории", МассивКатегорий);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИзбранноеБазыЗнаний.Пользователь
	|ИЗ
	|	РегистрСведений.ИзбранноеБазыЗнаний КАК ИзбранноеБазыЗнаний
	|ГДЕ
	|	ИзбранноеБазыЗнаний.КатегорияБазыЗнаний В(&Категории)
	|	И ИзбранноеБазыЗнаний.Пользователь <> &ТекущийПользователь
	|	И ИСТИНА";
	РеквизитыУсловия = СоответствиеТипов.Получить(ВидНовости);
	Если НЕ РеквизитыУсловия = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИСТИНА", "И " + РеквизитыУсловия);
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Получатели.Найти(Выборка.Пользователь) = Неопределено Тогда
			Получатели.Добавить(Выборка.Пользователь);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьОбъектНовостьБазыЗнаний(Автор, Заголовок, ОбъектБазыЗнаний)
	
	ДатаНовости = ТекущаяДатаСеанса();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заголовок"			, Заголовок);
	Запрос.УстановитьПараметр("НачалоДня"			, НачалоДня(ДатаНовости));
	Запрос.УстановитьПараметр("КонецДня"			, КонецДня(ДатаНовости));
	Запрос.УстановитьПараметр("ОбъектБазыЗнаний"	, ОбъектБазыЗнаний);
	Запрос.УстановитьПараметр("Автор"				, Автор);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НовостиБазыЗнаний.Ссылка
	|ИЗ
	|	Справочник.НовостиБазыЗнаний КАК НовостиБазыЗнаний
	|ГДЕ
	|	НовостиБазыЗнаний.Наименование = &Заголовок
	|	И НовостиБазыЗнаний.Дата МЕЖДУ &НачалоДня И &КонецДня
	|	И НовостиБазыЗнаний.ОбъектБазыЗнаний = &ОбъектБазыЗнаний
	|	И НовостиБазыЗнаний.Автор = &Автор";
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
	    Возврат Справочники.НовостиБазыЗнаний.СоздатьЭлемент();
	Иначе 
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
КонецФункции

// Автор - СправочникСсылка.Пользователи
// Заголовок - Строка
// ТекстHTML - Строка
// ОбъектБазыЗнаний - СправочникСсылка.КатегорииБазыЗнаний, СтатьиБазыЗнаний, КомментарииБазыЗнаний
// ВидНовости - ПеречислениеСсылка.ВидыНовостейБазыЗнаний
Функция ДобавитьНовость(знач Автор, знач Заголовок, знач ТекстHTML, знач ОбъектБазыЗнаний = Неопределено, знач ВидНовости = Неопределено, Получатели = Неопределено, знач Важность = 2, знач Текст = "") Экспорт 
	
	Если ПустаяСтрока(Текст) Тогда
		Текст = СтроковыеФункцииКлиентСервер.ИзвлечьТекстИзHTML(ТекстHTML);
	КонецЕсли;
	
	Если НЕ ТипЗнч(Получатели) = Тип("Массив") Тогда
		Получатели = Новый Массив;
	КонецЕсли;
	
	Если ВидНовости = Неопределено Тогда
		ВидНовости = Перечисления.ВидыНовостейБазыЗнаний.Прочее; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектБазыЗнаний) Тогда
		ДополнитьПолучателейНовостиПоВидуИОбъекту(Получатели, ВидНовости, ОбъектБазыЗнаний);
	КонецЕсли;
	
	СоздаватьОбщуюЗапись = (ВидНовости = Перечисления.ВидыНовостейБазыЗнаний.Оповещение
		ИЛИ ВидНовости = Перечисления.ВидыНовостейБазыЗнаний.Прочее);

	Если Получатели.Количество() = 0 И СоздаватьОбщуюЗапись Тогда
		Получатели.Добавить(Справочники.Пользователи.ПустаяСсылка());
	КонецЕсли;
	
	Если Получатели.Количество() = 0 Тогда
		Возврат Справочники.НовостиБазыЗнаний.ПустаяСсылка();
	КонецЕсли;
	
	ЭлементОбъект = ПолучитьОбъектНовостьБазыЗнаний(Автор, Заголовок, ОбъектБазыЗнаний);
	ЭлементОбъект.Автор				= Автор;
	ЭлементОбъект.Наименование		= Заголовок;
	ЭлементОбъект.ТекстHTML			= ТекстHTML;
	ЭлементОбъект.Текст				= Текст;
	ЭлементОбъект.Дата				= ТекущаяДатаСеанса();
	ЭлементОбъект.ОбъектБазыЗнаний	= ОбъектБазыЗнаний;
	ЭлементОбъект.Важность			= Важность;	
	ЭлементОбъект.Вид				= ВидНовости;
	ЭлементОбъект.Записать();
	
	Для Каждого ПолучательСсылка Из Получатели Цикл
		
		НаборЗаписей = РегистрыСведений.ПолучателиНовостейБазыЗнаний.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Новость.Установить(ЭлементОбъект.Ссылка);
		НаборЗаписей.Отбор.Пользователь.Установить(ПолучательСсылка);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			ЗаписьРегистра = НаборЗаписей.Добавить();
			ЗаписьРегистра.Новость		= ЭлементОбъект.Ссылка;
			ЗаписьРегистра.Пользователь	= ПолучательСсылка;
		Иначе 
			ЗаписьРегистра = НаборЗаписей[0];
		КонецЕсли;
		
		ЗаписьРегистра.Просмотрено = Ложь;
		
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
	Возврат ЭлементОбъект.Ссылка;
	
КонецФункции
